tooling.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-03-09 Mon 03:14 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Category: Tooling</title>
<meta name="generator" content="Org Mode" />
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1.0, user-scalable=yes">
<meta http-equiv="Content-Security-Policy" content="style-src-elem 'self' https://wmealing.github.io;">
<link rel="stylesheet" href="index.css">
<meta name="author" content="Wade Mealing" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Category: Tooling</h1>
<nav class="navbar-custom">
    <div class="navbar-grid">

        <div class="navbar-section">
            <a href="systems.html" style="text-decoration: none;"><h3>Systems & Distributed Programming</h3></a>
            <div class="navbar-tags">
                <a href="systems.html" style="text-decoration: none;"><span class="navbar-tag systems">Erlang/OTP</span></a>
                <a href="systems.html" style="text-decoration: none;"><span class="navbar-tag systems">Clojure</span></a>
                <a href="systems.html" style="text-decoration: none;"><span class="navbar-tag systems">Lisp Flavored Erlang</span></a>
                <a href="systems.html" style="text-decoration: none;"><span class="navbar-tag special">Cellium (TUI Framework)</span></a>
            </div>
        </div>

        <div class="navbar-section">
            <a href="security.html" style="text-decoration: none;"><h3>Security & Kernel Research</h3></a>
            <div class="navbar-tags">
                <a href="security.html" style="text-decoration: none;"><span class="navbar-tag security">Linux Kernel Analysis</span></a>
                <a href="security.html" style="text-decoration: none;"><span class="navbar-tag security">eBPF</span></a>
                <a href="security.html" style="text-decoration: none;"><span class="navbar-tag security">Malware Reversing</span></a>
                <a href="security.html" style="text-decoration: none;"><span class="navbar-tag security">Rust</span></a>
            </div>
        </div>

        <div class="navbar-section">
            <a href="tooling.html" style="text-decoration: none;"><h3>Tooling & Workflow</h3></a>
            <div class="navbar-tags">
                <a href="tooling.html" style="text-decoration: none;"><span class="navbar-tag tooling">Emacs / Elisp</span></a>
                <a href="tooling.html" style="text-decoration: none;"><span class="navbar-tag tooling">CI/CD Pipelines</span></a>
                <a href="tooling.html" style="text-decoration: none;"><span class="navbar-tag tooling">OpenSCAD</span></a>
            </div>
        </div>

    </div>
</nav>
<div id="outline-container-orgfcd6487" class="outline-2">
<h2 id="orgfcd6487">Posts in Tooling</h2>
<div class="outline-text-2" id="text-orgfcd6487">
<ul class="org-ul">
<li><a href="custom-software-errors.html">Higher quality errors for custom software.</a></li>
<li>[[<a href="emacs-org-babel-analysis.html">emacs-org-babel-analysis.html</a>][ Emacs and Org-babel for flaw analysis.</li>
</ul>
<p>
Evaluation of flaw: **CVE-YYYY-NNNNN**]]
</p>
<ul class="org-ul">
<li><a href="erlang-emacs-2025.html">Setting up Emacs for Erlang in 2025</a></li>
<li><a href="eunit-parallel.html">REPLACE</a></li>
<li><a href="eunit-surefire-report.html">Consuming eunit surefire xml reports.</a></li>
<li><a href="feed-llm-janet.html">Feed and caring of your LLM for janet lang.</a></li>
<li><a href="github-not-connecting.html">Rebar3 not connecting to github.</a></li>
<li><a href="lfe-github-actions.html">Github actions (CI/CD) for LFE.</a></li>
<li><a href="using-style-dictionaries.html">Using "style-dictionary" from Clojure.</a></li>
</ul>
</div>
</div>
</div>
</body>
</html>
